In [1]:
import sqlalchemy
import pymysql

pymysql.install_as_MySQLdb()

%load_ext sql

# Connect to a database in mySQL

In [2]:
sqlalchemy.create_engine('mysql://ramadian:password@localhost/snp500')

Engine(mysql://ramadian:***@localhost/snp500)

In [3]:
%sql mysql://ramadian:password@localhost/snp500

'Connected: ramadian@snp500'

###################################################

# Create a table

In [25]:
%%sql 
CREATE TABLE CompanyBySector
(Ticker varchar(50),
 CompanyName varchar(50),
 Sector varchar(50),
 StockPrice decimal(6,2)
)

 * mysql://ramadian:***@localhost/snp500
1 rows affected.

[('CompanyBySector',)]

In [5]:
%sql SELECT * FROM CompanyBySector

 * mysql://ramadian:***@localhost/snp500
0 rows affected.

[]

# Load data from an excel file

In [24]:
%%sql

LOAD DATA INFILE '/var/lib/mysql-files/snp500-company-by-sector.csv'
INTO TABLE CompanyBySector
FIELDS TERMINATED BY ';' 
ENCLOSED BY '"'
LINES TERMINATED BY '\n'
IGNORE 1 ROWS

 * mysql://ramadian:***@localhost/snp500
491 rows affected.

[]

# Select TOP $n$ data

In [31]:
%%sql
SELECT * FROM CompanyBySector
LIMIT 5

 * mysql://ramadian:***@localhost/snp500
5 rows affected.

[('AAP', 'Advance Auto Parts', 'Consumer Discretionary', Decimal('109.63')),
 ('AMZN', 'Amazon.com Inc', 'Consumer Discretionary', Decimal('1350.50')),
 ('APTV', 'Aptiv Plc', 'Consumer Discretionary', Decimal('89.27')),
 ('AZO', 'AutoZone Inc', 'Consumer Discretionary', Decimal('718.57')),
 ('BBY', 'Best Buy Co. Inc.', 'Consumer Discretionary', Decimal('68.79'))]

# TOP with ORDER BY

In [44]:
%%sql
SELECT * FROM CompanyBySector
ORDER BY StockPrice DESC
LIMIT 5

 * mysql://ramadian:***@localhost/snp500
5 rows affected.

[('PCLN', 'Priceline.com Inc', 'Consumer Discretionary', Decimal('1806.06')),
 ('AMZN', 'Amazon.com Inc', 'Consumer Discretionary', Decimal('1350.50')),
 ('GOOGL', 'Alphabet Inc Class A', 'Information Technology', Decimal('1007.71')),
 ('GOOG', 'Alphabet Inc Class C', 'Information Technology', Decimal('1001.52')),
 ('AZO', 'AutoZone Inc', 'Consumer Discretionary', Decimal('718.57'))]

# Count by group

In [38]:
%%sql
SELECT Sector, COUNT(*) AS Number
FROM CompanyBySector
GROUP BY Sector

 * mysql://ramadian:***@localhost/snp500
11 rows affected.

[('Consumer Discretionary', 83),
 ('Consumer Staples', 33),
 ('Energy', 31),
 ('Financials', 65),
 ('Health Care', 59),
 ('Industrials', 66),
 ('Information Technology', 67),
 ('Materials', 25),
 ('Real Estate', 31),
 ('Telecommunication Services', 3),
 ('Utilities', 28)]

# Max and Min

In [45]:
%%sql
SELECT MAX(StockPrice) AS MaxStockPrice, MIN(StockPrice) AS MinStockPrice
FROM CompanyBySector

 * mysql://ramadian:***@localhost/snp500
1 rows affected.

[(Decimal('1806.06'), Decimal('2.82'))]

Max and min with group by

In [51]:
%%sql
SELECT Sector, MAX(StockPrice) AS MaxStockPrice, MIN(StockPrice) AS MinStockPrice
FROM CompanyBySector
GROUP BY Sector

 * mysql://ramadian:***@localhost/snp500
11 rows affected.

[('Consumer Discretionary', Decimal('1806.06'), Decimal('10.43')),
 ('Consumer Staples', Decimal('208.73'), Decimal('27.57')),
 ('Energy', Decimal('169.16'), Decimal('2.82')),
 ('Financials', Decimal('509.38'), Decimal('13.38')),
 ('Health Care', Decimal('601.00'), Decimal('25.20')),
 ('Industrials', Decimal('334.30'), Decimal('14.45')),
 ('Information Technology', Decimal('1007.71'), Decimal('11.22')),
 ('Materials', Decimal('387.65'), Decimal('17.16')),
 ('Real Estate', Decimal('409.98'), Decimal('14.01')),
 ('Telecommunication Services', Decimal('49.04'), Decimal('16.20')),
 ('Utilities', Decimal('145.29'), Decimal('10.06'))]

# Distinct

In [52]:
%%sql
SELECT DISTINCT Sector
FROM CompanyBySector

 * mysql://ramadian:***@localhost/snp500
11 rows affected.

[('Consumer Discretionary',),
 ('Consumer Staples',),
 ('Energy',),
 ('Financials',),
 ('Health Care',),
 ('Industrials',),
 ('Information Technology',),
 ('Materials',),
 ('Real Estate',),
 ('Telecommunication Services',),
 ('Utilities',)]

# Statistical Functions: sum, average

In [53]:
%%sql
SELECT SUM(StockPrice) AS SumStockPrice, AVG(StockPrice) AS AvgStockPrice
FROM CompanyBySector

 * mysql://ramadian:***@localhost/snp500
1 rows affected.

[(Decimal('50930.16'), Decimal('103.727413'))]

# Statistical Functions: variance population and variance sample

In [66]:
%%sql
SELECT VAR_POP(StockPrice) AS StockPriceVariance
FROM CompanyBySector

 * mysql://ramadian:***@localhost/snp500
1 rows affected.

[(18434.023306344323,)]

In [64]:
%%sql
SELECT Sector, VAR_SAMP(StockPrice) AS StockPriceVarianceSample
FROM CompanyBySector
WHERE Sector = 'Energy'
GROUP BY Sector

 * mysql://ramadian:***@localhost/snp500
1 rows affected.

[('Energy', 1514.5252313978492)]

# Statistical Functions: standard deviation population and standard deviation sample

STDDEV_POP & STDDEV_SAMP